How to create Pandas Dataframe

In [2]:
import pandas as pd

In [8]:
emt_df=pd.DataFrame() #`emt_df = pd.DataFrame()` creates an empty Pandas DataFrame with no rows or columns.
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [10]:
lst=['a','b','c']#The list `lst = ['a', 'b', 'c']` is a simple Python list containing the elements `'a'`, `'b'`, and `'c'`. 

print(lst)

['a', 'b', 'c']

In [14]:
df1=pd.DataFrame(lst)#`df1 = pd.DataFrame(lst)` creates a Pandas DataFrame from the list `lst = ['a', 'b', 'c']`, with each element of the list as a value in a single column, and the index being the default integer index `[0, 1, 2]`.
print(df1)

   0
0  a
1  b
2  c

In [16]:
df1#Here, the list ['a', 'b', 'c'] is converted into a DataFrame with one column labeled 0 and the default integer index [0, 1, 2].

   0
0  a
1  b
2  c

In [18]:
ls_of_ls=[[1,2,3],[2,3,4],[4,5,6]]#The variable ls_of_ls = [[1, 2, 3], [2, 3, 4], [4, 5, 6]] is a list of lists, where each inner list contains three integer elements.
print(ls_of_ls)

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [20]:
df2=pd.DataFrame(ls_of_ls)#`df2 = pd.DataFrame(ls_of_ls)` creates a DataFrame from the list of lists, where each inner list becomes a row and the columns are automatically labeled `0`, `1`, and `2`.
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [22]:
dict1={'ID':[11,22,33,44]}#`dict1 = {'ID': [11, 22, 33, 44]}` creates a dictionary with a single key `'ID'` and a list of values `[11, 22, 33, 44]`.
dict1

{'ID': [11, 22, 33, 44]}

In [24]:
df3=pd.DataFrame(dict1)#`df3 = pd.DataFrame(dict1)` creates a DataFrame from the dictionary `dict1`, where the key `'ID'` becomes the column name and the corresponding list `[11, 22, 33, 44]` becomes the column values.
df3

   ID
0  11
1  22
2  33
3  44

In [36]:
dict1={'ID':[11,22,33,44],'SN':[1,2,3,4]}#`dict1 = {'ID': [11, 22, 33, 44], 'SN': [1, 2, 3, 4]}` creates a dictionary with two keys, `'ID'` and `'SN'`, each associated with a list of values.
dict1

{'ID': [11, 22, 33, 44], 'SN': [1, 2, 3, 4]}

In [38]:
df3=pd.DataFrame(dict1)#`df3 = pd.DataFrame(dict1)` creates a DataFrame with columns `'ID'` and `'SN'` from the dictionary `dict1`, where the values are `[11, 22, 33, 44]` and `[1, 2, 3, 4]`, respectively.
df3

   ID  SN
0  11   1
1  22   2
2  33   3
3  44   4

In [42]:
ls_dict=[{'a':1,'b':2},{'a':3,'b':4}]#`ls_dict = [{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]` creates a list of dictionaries, where each dictionary contains key-value pairs for `'a'` and `'b'`.
df5=pd.DataFrame(ls_dict)
df5

   a  b
0  1  2
1  3  4

In [44]:
ls_dict=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]#`ls_dict = [{'a': 1, 'b': 2}, {'a': 3, 'b': 4, 'c': 5}]` creates a list of dictionaries with different keys; the second dictionary includes an additional key `'c'`.
df5=pd.DataFrame(ls_dict)
df5

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [46]:
dict_sr={'ID':pd.Series([1,2,3]),'SN':pd.Series([111,222,333])}
df6=pd.DataFrame(dict_sr)
df6

   ID   SN
0   1  111
1   2  222
2   3  333